// Задача 10: Напишите программу, которая принимает на вход трёхзначное 
//число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1


// int num =  new Random().Next(100,1000);
// Console.WriteLine(num);
// int num1 = num/10;
// int num2 = num1%10;
// Console.WriteLine(num2);

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа
// или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// int num = new Random().Next(76,10000);
// if(num < 100){
//     Console.WriteLine($"Изначальное число {num} Третьей цифры нет");
// }else{
//     Console.WriteLine(num);
//     Console.WriteLine(num.ToString()[2]);
// }

// Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// int num = new Random().Next(1,8);
// Console.WriteLine(num);
// if(num <= 5){
//     Console.WriteLine("нет");
// }else{
//     Console.WriteLine("да");
// }
